tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "beeftornado/rmtree"

brew "ack"
brew "cabal-install"
brew "cmake"
brew "gcc"
brew "git"
brew "llvm"
brew "loc"
brew "sqlite"
brew "python"
brew "shellcheck"
brew "tmux"
brew "vim"
brew "zsh"

cask "firefox"
cask "iterm2"
cask "slack"
cask "font-fira-code"
cask "bitwarden"
cask "standard-notes"
cask "gimp"
cask "mactex"
cask "macvim"
cask "mgba"
cask "multipatch"

instance_eval(File.read("./.Brewfile.local"))
